{"blinks": [{"title": "Introduction to Angular 🚀", "description": "Angular is a robust framework for building efficient and complex single-page web apps. It's great for both beginners working on their first app, and professionals who are optimizing elaborate apps for companies. Handy feature: it comes with tutorials and guides, complete with downloadable examples for you to kick-start your projects! 😄", "code": "", "difficulty": "beginner"}, {"title": "Assumed Knowledge 🧠", "description": "Hold up! Before diving into Angular, you should already have a basic understanding of HTML, CSS, JavaScript, and latest standard tools like classes and modules. While the samples they provide are in TypeScript, it's important to know that most Angular code can be written with just the latest JavaScript. So, it's not necessary to be a TypeScript pro to get started! 🤓", "code": "", "difficulty": "beginner"}, {"title": "The Power of TypeScript in Angular 💪", "description": "While you can use just JavaScript for Angular, adopting TypeScript comes with its own perks! TypeScript's types can greatly enhance dependency injection and let you use decorators for metadata, making your code cleaner and more efficient. This might sound tricky, but don't worry, you'll get the hang of it soon enough! 😉", "code": "", "difficulty": "intermediate"}, {"title": "Feedback & Contributions to Angular 💌", "description": "Angular is a community-driven project open to suggestions and feedbacks. Having a problem, or an idea for future docs? Don't hesitate to share it! You can even leave your own mark on Angular by creating pull requests on their GitHub repository. It's a great way to give back and help the community flourish. Remember to always respect and support each other! 😊", "code": "", "difficulty": "beginner"}, {"title": "🧠 What is Angular?🤖", "description": "Angular is a development platform, built on TypeScript📚. It includes a component-based framework for building scalable web applications🌐, a collection of libraries offering a wide range of features (like routing, forms management, and client-server communication), and developer tools to streamline your code. Use Angular to build projects that can scale from single-developer projects to large enterprise applications.🚀", "code": "", "difficulty": "beginner"}, {"title": "🧩 Building Blocks of Angular: Components🔨", "description": "Components are fundamental to Angular. They're the building blocks that compose an application. A component includes a TypeScript class with Angular-specific information defined by a @Component() decorator, an HTML template, and styles. When applied to an HTML element in your template with a CSS selector, the the element becomes an instance of the component. The decorator also instructs Angular on rendering the component and optionally defines the appearance of the HTML elements in the template🎨.", "code": "@Component({\n  selector: 'hello-world',\n  template: `\n    <h2>Hello World</h2>\n    <p>This is my first component!</p>\n  `\n})\nexport class HelloWorldComponent {\n  // The code in this class drives the component's behavior.\n}", "difficulty": "beginner"}, {"title": "✨Angular Templates and Bindings🧵", "description": "Every Angular component has an HTML template that controls how it renders. Angular extends HTML with additional syntax, allowing dynamic values from the component to be inserted. Angular even automatically updates the rendered DOM when your component's state changes! Properties and attributes of HTML elements can also be set and controlled using property bindings🔗. Event listeners like (click) can be used to respond to user interactions💬.", "code": "<button\n  type=\"button\"\n  [disabled]=\"canClick\"\n  (click)=\"sayMessage()\">\n  Trigger alert message\n</button>", "difficulty": "beginner"}, {"title": "🔧 Angular Directives: *ngIf and *ngFor🔎", "description": "Add more features to your Angular templates using directives! Directives like *ngIf and *ngFor can dynamically modify the DOM structure and perform a range of tasks. For example, the *ngIf directive can dynamically display or hide elements💡.", "code": "<div *ngIf=\"canEdit; else noEdit\">\n    <p>You can edit the following paragraph.</p>\n</div>\n\n<ng-template #noEdit>\n    <p>The following paragraph is read only. Try clicking the button!</p>\n</ng-template>", "difficulty": "intermediate"}, {"title": "💉Dependency Injection in Angular💼", "description": "Dependency Injection (DI) allows your TypeScript classes to declare their dependencies without worrying about their instantiation - Angular takes care of that for you! This pattern helps write more testable and flexible code. For example, you can inject a service into a component class by specifying it in the constructor😎.", "code": "import { Component } from '@angular/core';\nimport { Logger } from '../logger.service';\n\n@Component({\n  selector: 'hello-world-di',\n  templateUrl: './hello-world-di.component.html'\n})\nexport class HelloWorldDependencyInjectionComponent  {\n  count = 0;\n\n  constructor(private logger: Logger) { }\n\n  onLogMe() {\n    this.logger.writeCount(this.count);\n    this.count++;\n  }\n}", "difficulty": "intermediate"}, {"title": "🤓Angular CLI: Your Best Friend💼", "description": "The Angular CLI (Command Line Interface) is the fastest and recommended way to develop Angular applications. It simplifies tasks like building your application, serving it, generating or modifying files based on a schematic, running unit tests and even running end-to-end tests. This makes it an invaluable tool in your Angular journey! ⚡", "code": "ng build // Compiles an Angular application into an output directory.\nng serve // Builds and serves your application, rebuilding on file changes.\nng generate // Generates or modifies files based on a schematic.\nng test // Runs unit tests on a given project.\nng e2e // Builds and serves an Angular application, then runs end-to-end tests.", "difficulty": "beginner"}, {"title": "📚 First-party Libraries in Angular 🗂", "description": "When your application grows and you need to add more features, make use of the many first-party libraries that Angular provides. These libraries, which include Angular Router, Angular Forms, Angular HttpClient, Angular Animations, Angular PWA, and Angular Schematics, expand your application's abilities, letting you focus more on your application's unique features🚀.", "code": "", "difficulty": "intermediate"}, {"title": "URL Navigation in Single Page Applications 🔗", "description": "In a Single Page Application (SPA), you can interact with the page and navigate within the program without refreshing your browser. You can type a URL in the address bar to navigate to a corresponding page or click links on the page to navigate within the application! Plus, you can click the browser's back and forward buttons to navigate the browser history same as you would do with conventional web pages! 😃", "code": "", "difficulty": "intermediate"}, {"title": "Associating a URL Path with a Component 👣", "description": "In Angular applications, we can associate a URL path with a specific component. This is done using the Angular Router. From the HTML content, a route is defined to show individual product details. The route is defined in 'app.module.ts', indicative of the product details with a path of 'products/:productId' and 'ProductDetailsComponent' for the component. This is followed by adding a router link with the product.id as a parameter in the product list anchor tag.⚙️", "code": "@NgModule({\n  imports: [\n    BrowserModule,\n    ReactiveFormsModule,\n    RouterModule.forRoot([\n      { path: '', component: ProductListComponent },\n      { path: 'products/:productId', component: ProductDetailsComponent },\n    ])\n  ],\n  declarations: [\n    AppComponent,\n    TopBarComponent,\n    ProductListComponent,\n    ProductAlertsComponent,\n    ProductDetailsComponent,\n  ],\n})", "difficulty": "advanced"}, {"title": "Using Angular Router to Display Components Based on URL 👀", "description": "The Angular Router is a powerful tool that can display components based on the browser's URL and your defined routes. You can use it to combine the data and route information to display specific details for each product or page. With Angular Router, we can write code to display product details based on the URL and extract product-specific parameters from the route. 🚀", "code": "ngOnInit() {\n  // First get the product id from the current route.\n  const routeParams = this.route.snapshot.paramMap;\n  const productIdFromRoute = Number(routeParams.get('productId'));\n\n  // Find the product that correspond with the id provided in route.\n  this.product = products.find(product => product.id === productIdFromRoute);\n}", "difficulty": "advanced"}, {"title": "Setting Up an Angular Checkout Form 🛒", "description": "To set up a checkout form in Angular, you first define the form model in your component class. This model controls the status of the form. You use the FormBuilder service provided by @angular/forms package to create the form controls. The form model is then injected into the CartComponent using the constructor. 🧪", "code": "export class CartComponent {\n  constructor(\n    private cartService: CartService,\n    private formBuilder: FormBuilder,\n  ) {}\n  checkoutForm = this.formBuilder.group({\n    name: '',\n    address: ''\n  });\n}", "difficulty": "beginner"}, {"title": "Processing the Form Submission in Angular 📤", "description": "After setting up a form in Angular, we need an onSubmit() method to handle the form submission. This method takes the user's name and address. It uses a service method called clearCart() to reset the form and clear the cart after the form is submitted. Cool, right?👍", "code": "", "difficulty": "beginner"}, {"title": "Creating the Checkout Form in HTML with Angular 🖥️🎨", "description": "To render your Angular form in HTML, use a form element and bind the form model to it using the formGroup property. Angular's ngSubmit event can be used to listen for form submission events. Input fields are added for user's name and address using the formControlName attribute. Voila! Your checkout form is ready! 🎉", "code": "<form [formGroup]=\"checkoutForm\" (ngSubmit)=\"onSubmit()\">\n  <input id=\"name\" type=\"text\" formControlName=\"name\">\n  <input id=\"address\" type=\"text\" formControlName=\"address\">\n  <button class=\"button\" type=\"submit\">Purchase</button>\n</form>", "difficulty": "beginner"}, {"title": "Setting up Angular Development Environment", "description": "To start developing with Angular, we first need to set up our local development environment. This involves installing a few prerequisites on our system like Node.js, an active LTS or maintenance LTS version, and npm (node package manager). Our journey begins by installing Angular CLI (Command Line Interface), a handy tool that helps in creating projects, generating application and library code, and doing a variety of ongoing development tasks like testing and deployment.", "code": "npm install -g @angular/cli", "difficulty": "beginner"}, {"title": "Creating Angular workspace", "description": "Once we have our environment set up, we're ready to create our workspace. Within an Angular workspace is where we'll develop our apps. We can create a new workspace and an initial starter app using the Angular CLI command 'ng new'. This command will prompt us for more details about the features we want to include in our app. For now, we can stick with the default features.", "code": "ng new my-app", "difficulty": "beginner"}, {"title": "Running your Angular application", "description": "With our workspace and initial app ready, it's time for the exciting part - running our app! The Angular CLI includes a server that allows us to build and serve our app locally. This provides an environment to develop and test our application as we make changes to it. Navigate to the workspace folder and run the ng serve command. Our app will be served at http://localhost:4200/. If everything goes according to plan, we should be able to see our app running locally in our browser 👏🎉", "code": "cd my-app\nng serve --open", "difficulty": "beginner"}]}